<?php
// +---------------------------------------------------------------------------
// | NoxVMS  [ v0.1 ] 
// +---------------------------------------------------------------------------
// | Support [ ThinkPHP 3.2.3 http://thinkphp.cn ]
// +---------------------------------------------------------------------------
// | Autor   [ Hodge.Yuan@Hotmail.com ]
// +---------------------------------------------------------------------------
// | 应用入口文件
// +---------------------------------------------------------------------------

# 声明文档编码
header("Content-type:text/html;charset=UTF-8");

/*-----------------------------------------------------------------------------
 * 判断PHP环境
 *-----------------------------------------------------------------------------
 * ThinkPHP3.2.3框架要求最低PHP版本为5.3,更换版本号请注意.
 * 具体详情访问[http://thinkphp.cn]
 */ 
if(version_compare(PHP_VERSION,'5.3.0','<'))  die('Require PHP > 5.3.0 !');

/*-----------------------------------------------------------------------------
 * 调试模式
 *-----------------------------------------------------------------------------
 * 用于项目开发调试用,部署项目时请关闭调试模式
 * define('APP_DEBUG',false);
 */
define('APP_DEBUG',false);

# 定义应用目录
define('APP_PATH','./NoxVMS/');

/*-----------------------------------------------------------------------------
 * 声明上传目录常量 ：__UPLOAD__
 *-----------------------------------------------------------------------------
 * 改常量为自定义常量,模板支持使用 __UPLOAD__ , 
 * 注册模板常量-> ./Think/Library/Behavior/ContentReplaceBehavior.class.php => 
 * protected function templateContentReplace();
 */
define('__UPLOAD__','/Upload');

# 自定义安全文件内容
define('DIR_SECURE_CONTENT','<title>Error</title><h1>Directory Listing Denied</h1>');
 
# 加载ThinkPHP
require './Think/ThinkPHP.php';

