<?php
// +---------------------------------------------------------------------------
// | NoxVMS  [ v0.1 ] 
// +---------------------------------------------------------------------------
// | Support [ ThinkPHP 3.2.3 http://thinkphp.cn ]
// +---------------------------------------------------------------------------
// | Autor   [ Hodge.Yuan@Hotmail.com ]
// +---------------------------------------------------------------------------
// | 安装文件
// +---------------------------------------------------------------------------

# 声明文档编码
header("Content-type:text/html;charset=UTF-8");

# PHP
if(version_compare(PHP_VERSION,'5.3.0','<'))  die('Require PHP > 5.3.0 !');

# 调试模式
define('APP_DEBUG',true);

# 定义应用目录
define('APP_PATH','./Install/');

# 加载ThinkPHP
require './ThinkPHP/ThinkPHP.php';

