<?php 
// +-------------------------------------------------
// | NoxVMS  [ v0.1 ] 
// +-------------------------------------------------
// | OSC	 [ http://git.oschina.net/sbcode/NoxVMS ]
// +-------------------------------------------------
// | Autor   [ Hodge.Yuan@Hotmail.com ]
// +-------------------------------------------------
// | noxvms安装文件，数据安装完成后，该文件将自动删除
// | 如果安装完成后无法自动删除，请手动删除
// +-------------------------------------------------

header("Content-type:text/html;charset=UTF-8");
date_default_timezone_set('PRC');